Repository: apkoponen/wp-rest-api-oauth2
Catalog: languages/wp_rest_oauth2-*.po
Languages: fi

source: Authorized Applications (OAuth 2.0)
fi: Valtuutetut sovellukset (OAuth 2.0)

source: Application Name
fi: Sovelluksen nimi

source: Revoke
fi: Peruuta valtuutus

source: No applications authorized.
fi: Ei valtuutettuja sovelluksia.

source: Token revoked.
fi: Valtuutus peruutettu.

source: Unable to revoke token.
fi: Valtuutuksen peruutus ei onnistunut.

source: Token not found.
fi: Valtuutusta ei löydetty.

source: Cheatin&#8217; uh?
fi: Huijaatko?

source: You are not allowed to edit this token or the token does not exist.
fi: Sinulla ei ole oikeutta muokata tätä valtuutta tai valtuutta ei ole olemassa.

source: Registered OAuth 2.0 Applications
fi: Rekisteröidyt OAuth 2.0 sovellukset

# menu title
source: Applications (OAuth 2.0)
fi: Sovellukset (OAuth 2.0)

source: Registered Applications (OAuth 2.0)
fi: Rekisteröidyt sovellukset (OAuth 2.0)

# application
source: Add New
fi: Lisää uusi

source: Deleted application.
fi: Sovellus poistettu.

source: Search Applications
fi: Hae sovelluksia

source: Consumer name is required
fi: Asiakkaan nimi on pakollinen

source: Consumer description is required
fi: Asiakkaan kuvaus on pakollinen

source: Consumer redirect URI is required and must be a valid URL.
fi: Asiakkaan uudelleenohjaus URI on pakollinen ja sen täytyy olla oikein muotoiltu URL-osoite.

source: You do not have permission to access this page.
fi: Sinulla ei ole oikeutta katsella tätä sivua.

source: Invalid consumer ID.
fi: Tuntematon asiakkaan ID.

source: Updated application.
fi: Sovellus päivitetty.

source: Regenerated secret.
fi: Salaisuus uudistettu.

source: Successfully created application.
fi: Sovellus luotiin onnistuneesti.

source: Edit Application
fi: Muokkaa sovellusta

source: Add Application
fi: Lisää sovellus

# field name
source: Consumer Name
fi: Asiakkaan nimi

source: This is shown to users during authorization and in their profile.
fi: Tämä näytetään käyttäjille valtuutuksen yhteydessä ja profiilisivulla.

# field name
source: Description
fi: Kuvaus

# field name
source: Redirect URI
fi: Uudelleenohjaus URI

source: Your application's redirect URI. The redirect URI passed to the authorization endpoint must match the scheme, host, port, and path of this URI.
fi: Sovelluksesi uudelleenohjaus URI. Uudelleenohjaus URI, joka välitetään valtuutuspäätepisteelle täytyy olla sama kuin tämä URI.

source: Add Consumer
fi: Lisää asiakas

source: Save Consumer
fi: Tallenna asiakas

source: OAuth 2.0 Credentials
fi: OAuth 2.0 tunnukset

source: Client ID
fi: Asiakkaan ID

source: Client Secret
fi: Asiakkaan salaisuus

source: Regenerate Secret
fi: Uudista salaisuus

source: You are not allowed to delete this application.
fi: Sinulla ei ole oikeutta poistaa tätä sovellusta.

source: You are not allowed to edit this application.
fi: Sinulla ei ole oikeutta muokata tätä sovellusta.

source: The client redirect URI does not match the provided URI.
fi: Asiakkaan uudelleenohjaus URI ei vastaa annettua URI:a.

source: Name
fi: Nimi

source: Description
fi: Kuvaus

source: Select consumer
fi: Valitse asiakas

source: Untitled
fi: Nimetön

source: Edit
fi: Muokkaa

source: Delete
fi: Poista

source: Error
fi: Virhe

source: The request is missing a required parameter, includes an invalid parameter value, includes a parameter more than once, or is otherwise malformed.
fi: Pyynnöstä puuttuu vaadittu parametri, se sisältää virheellisen parametrin arvon, se sisältää saman parametrin useammin kuin kerran tai on muuten virheellinen.

source: The client is not authorized to request an authorization code using this method.
fi: Asiakkaalla ei ole oikeutta pyytää valtuutuskoodia tällä metodilla.

source: The resource owner or authorization server denied the request.
fi: Resurssien omistaja tai valtuutuspalvelin eväsi pyynnön.

source: The authorization server does not support obtaining an authorization code using this method.
fi: Valtuutuspalvelin ei tue valtuutuskoodin hankkimista tällä tavalla.

source: The requested scope is invalid, unknown, or malformed.
fi: Pyynnön laajuus on virheellinen, tuntematon tai väärin muotoiltu.

source: The authorization server encountered an unexpected condition that prevented it from fulfilling the request.
fi: Valtuutuspalvelin kohtasi odottamattoman ongelman, joka esti pyynnön täyttämisen.

source: The authorization server is currently unable to handle the request due to a temporary overloading or maintenance of the server.
fi: Valtuutuspalvelin ei tällä hetkellä voi käsitellä pyyntöä hetkellisen liiallisen kuorman tai ylläpitotoimien vuoksi.

source: Client authentication failed (e.g., unknown client, no client authentication included, or unsupported authentication method).
fi: Asiakkaan todennus epäonnistui (esim. tuntematon asiakas, asiakkaan tunnukset puuttuivat, tai todennustapaa ei tueta).

source: The provided authorization grant (e.g., authorization code, resource owner credentials) or refresh token is invalid, expired, revoked, does not match the redirection URI used in the authorization request, or was issued to another client.
fi: Annettu valtuutuslupa (esim. valtuutuskoodi, resurssin omistajan tunnukset) tai päivitysvaltuus on virheellinen, vanhentunut, peruutettu, ei vastaa valtuutuspyynnön uudelleenohjaus URI:a, tai on myönnetty toiselle asiakkaalle.

source: The authenticated client is not authorized to use this authorization grant type.
fi: Todennettu asiakas ei ole valtuutettu käyttämään tätä valuutuslupatyyppiä.

source: The authorization grant type is not supported by the authorization server.
fi: Valtuutuspalvelin ei tue valtuutuslupatyyppiä.

source: The user credentials were incorrect.
fi: Käyttäjän tunnukset olivat väärät.

source: SSL is required
fi: SSL vaaditaan

source: OAuth 2.0 does not use Client Keys. Use get_by_client_id instead.
fi: OAuth 2. 0 ei tue asiakkaan avaimia. Käytä get_by_client_id:tä tämän sijasta.

source: Client ID is invalid
fi: Asiakkaan ID on virheellinen.

source: Overridden class must implement get_type
fi: Ylikirjoitetun luokan täytyy toteuttaa get_type.

source: Token does not exist.
fi: Valtuutta ei ole olemassa.

source: Token with given post ID does not exist.
fi: Annetulla artikkelin ID:llä ei löydy valtuutta.

source: Token has expired.
fi: Valtuus on vanhentunut.

source: Could not save new token.
fi: Uutta valtuutta ei voitu tallentaa.

source: Could not update client metadata.
fi: Asiakkaan meta-tietoja ei voitu päivittää.

source: Client ID is not valid.
fi: Asiakkaan ID on virheellinen.

source: Consumer Key is invalid
fi: Asiakkaan avain on virheellinen.

source: Consumers
fi: Asiakkaat

source: Consumer
fi: Asiaka

source: Access tokens
fi: Pääsyvaltuudet

source: Access token
fi: Pääsyvaltuu

source: Refresh tokens
fi: Päivitysvaltuudet

source: Refresh token
fi: Päivitysvaltuus

source: Authorize
fi: Valtuuta

source: Authorize %1$s
fi: Valtuuta %1$s

source: Howdy <strong>%1$s</strong>,<br/> <em>"%2$s"</em> would like to connect to <em>"%3$s"</em>.
fi: Hei <strong>%1$s</strong>,<br/> <em>"%2$s"</em> pyytää pääsyä sivustolle <em>"%3$s"</em>.

source: Capabilities to be granted:
fi: Sallittavat oikeudet:

source: All of you capabilities ( * ).
fi: Kaikki oikeudet (*).

source: "%1$s" will be allowed to use these capabilities on your behalf.
fi: "%1$s" sallitaan käyttää nämä oikeudet käyttäjätiliisi.

source: Cancel
fi: Peruuta

source: Switch user
fi: Vaihda käyttäjä

source: Register
fi: Rekisteröidy
